prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
/*!
    \file    main.c
    \brief   EdgeCare state-machine bring-up for GD32H759

    Current bring-up scope:
      - active-low alarm lamp on PA8
      - USART0 printf log on EVAL_COM
      - LD2410 digital OUT presence trigger on PF8
      - OV5640/OV2640 SCCB ID probe on PB10/PB11
      - DCI/DMA one-shot capture probe with timeout
*/

#include "gd32h7xx.h"
#include "gd32h759i_start.h"
#include "systick.h"
#include "board/board_config.h"
#include "bsp/bsp_alarm.h"
#include "bsp/bsp_radar_ld2410.h"
#include <stdio.h>
#include <string.h>

#define DCI_DATA_ADDRESS       ((uint32_t)&DCI_DATA)

typedef enum {
    EDGECARE_STATE_IDLE = 0,
    EDGECARE_STATE_ALARM
} edgecare_state_t;

typedef struct {
    edgecare_state_t state;
    uint32_t ts_ms;
    uint32_t seq;
    uint8_t radar_triggered;
    uint8_t alarm_active;
    uint32_t infer_ms;
    uint8_t confidence_percent;
} edgecare_context_t;

typedef struct {
    uint16_t reg;
    uint8_t value;
} camera_reg8_t;

typedef struct {
    uint8_t intrusion;
    uint8_t confidence_percent;
    uint8_t mean;
    uint8_t contrast;
} edgecare_infer_result_t;

static edgecare_context_t g_edgecare = {
    EDGECARE_STATE_IDLE,
    0U,
    0U,
    0U,
    0U,
    0U,
    0U
};

static uint32_t g_camera_capture_buffer[CAMERA_CAPTURE_WORDS] __attribute__((aligned(32)));
static uint8_t g_model_input_gray[MODEL_INPUT_BYTES] __attribute__((aligned(32)));

static const camera_reg8_t g_ov5640_qvga_yuv_probe_regs[] = {
    {0x3103U, 0x11U},
    {0x3008U, 0x42U},
    {0x3103U, 0x03U},
    {0x3017U, 0xFFU},
    {0x3018U, 0xFFU},
    {0x3034U, 0x1AU},
    {0x3035U, 0x11U},
    {0x3036U, 0x46U},
    {0x3037U, 0x13U},
    {0x3108U, 0x01U},
    {0x3630U, 0x36U},
    {0x3631U, 0x0EU},
    {0x3632U, 0xE2U},
    {0x3633U, 0x12U},
    {0x3621U, 0xE0U},
    {0x3704U, 0xA0U},
    {0x3703U, 0x5AU},
    {0x3715U, 0x78U},
    {0x3717U, 0x01U},
    {0x370BU, 0x60U},
    {0x3705U, 0x1AU},
    {0x3905U, 0x02U},
    {0x3906U, 0x10U},
    {0x3901U, 0x0AU},
    {0x3731U, 0x12U},
    {0x3600U, 0x08U},
    {0x3601U, 0x33U},
    {0x302DU, 0x60U},
    {0x3620U, 0x52U},
    {0x371BU, 0x20U},
    {0x471CU, 0x50U},
    {0x3A13U, 0x43U},
    {0x3A18U, 0x00U},
    {0x3A19U, 0xF8U},
    {0x3635U, 0x13U},
    {0x3636U, 0x03U},
    {0x3634U, 0x40U},
    {0x3622U, 0x01U},
    {0x3C01U, 0x34U},
    {0x3C04U, 0x28U},
    {0x3C05U, 0x98U},
    {0x3C06U, 0x00U},
    {0x3C07U, 0x08U},
    {0x3C08U, 0x00U},
    {0x3C09U, 0x1CU},
    {0x3C0AU, 0x9CU},
    {0x3C0BU, 0x40U},
    {0x3820U, 0x41U},
    {0x3821U, 0x07U},
    {0x3814U, 0x31U},
    {0x3815U, 0x31U},
    {0x3000U, 0x00U},
    {0x3002U, 0x1CU},
    {0x3004U, 0xFFU},
    {0x3006U, 0xC3U},
    {0x300EU, 0x58U},
    {0x302EU, 0x00U},
    {0x4300U, 0x30U},
    {0x501FU, 0x00U},
    {0x4713U, 0x03U},
    {0x4407U, 0x04U},
    {0x460BU, 0x35U},
    {0x460CU, 0x22U},
    {0x3824U, 0x02U},
    {0x5000U, 0xA7U},
    {0x5001U, 0xA3U},
    {0x3800U, 0x00U},
    {0x3801U, 0x00U},
    {0x3802U, 0x00U},
    {0x3803U, 0x04U},
    {0x3804U, 0x0AU},
    {0x3805U, 0x3FU},
    {0x3806U, 0x07U},
    {0x3807U, 0x9BU},
    {0x3808U, 0x01U},
    {0x3809U, 0x40U},
    {0x380AU, 0x00U},
    {0x380BU, 0xF0U},
    {0x380CU, 0x07U},
    {0x380DU, 0x68U},
    {0x380EU, 0x03U},
    {0x380FU, 0xD8U},
    {0x3810U, 0x00U},
    {0x3811U, 0x10U},
    {0x3812U, 0x00U},
    {0x3813U, 0x06U},
    {0x3618U, 0x00U},
    {0x3612U, 0x29U},
    {0x3708U, 0x64U},
    {0x3709U, 0x52U},
    {0x370CU, 0x03U},
    {0x3A02U, 0x03U},
    {0x3A03U, 0xD8U},
    {0x3A08U, 0x01U},
    {0x3A09U, 0x27U},
    {0x3A0AU, 0x00U},
    {0x3A0BU, 0xF6U},
    {0x3A0EU, 0x03U},
    {0x3A0DU, 0x04U},
    {0x3A14U, 0x03U},
    {0x3A15U, 0xD8U},
    {0x4001U, 0x02U},
    {0x4004U, 0x02U},
    {0x3008U, 0x02U}
};

static void cache_enable(void)
{
    SCB_EnableICache();
    SCB_EnableDCache();
}

static const char *edgecare_state_name(edgecare_state_t state)
{
    switch(state) {
    case EDGECARE_STATE_IDLE:
        return "IDLE";
    case EDGECARE_STATE_ALARM:
        return "ALARM";
    default:
        return "UNKNOWN";
    }
}

static uint8_t camera_wait_flag(uint32_t flag)
{
    uint32_t timeout = CAMERA_TIMEOUT;

    while(SET != i2c_flag_get(CAMERA_SCCB, flag)) {
        if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_NACK)) {
            i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_NACK);
            return 0U;
        }

        if(0U == timeout--) {
            return 0U;
        }
    }

    return 1U;
}

static void camera_sccb_init(void)
{
    rcu_i2c_clock_config(CAMERA_SCCB_IDX, RCU_I2CSRC_IRC64MDIV);
    rcu_periph_clock_enable(CAMERA_SCCB_GPIO_RCU);
    rcu_periph_clock_enable(CAMERA_CTRL_GPIO_RCU);
    rcu_periph_clock_enable(CAMERA_SCCB_RCU);

    gpio_af_set(CAMERA_SCCB_GPIO_PORT, CAMERA_SCCB_AF, CAMERA_SCCB_SCL_PIN);
    gpio_af_set(CAMERA_SCCB_GPIO_PORT, CAMERA_SCCB_AF, CAMERA_SCCB_SDA_PIN);

    gpio_mode_set(CAMERA_SCCB_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_PULLUP,
                  CAMERA_SCCB_SCL_PIN | CAMERA_SCCB_SDA_PIN);
    gpio_output_options_set(CAMERA_SCCB_GPIO_PORT, GPIO_OTYPE_OD, GPIO_OSPEED_12MHZ,
                            CAMERA_SCCB_SCL_PIN | CAMERA_SCCB_SDA_PIN);

    gpio_mode_set(CAMERA_CTRL_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_NONE,
                  CAMERA_RES_PIN | CAMERA_PWON_PIN);
    gpio_output_options_set(CAMERA_CTRL_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_12MHZ,
                            CAMERA_RES_PIN | CAMERA_PWON_PIN);

    /* Default guess: RES high releases reset, PWON/PWDN low powers the sensor. */
    gpio_bit_reset(CAMERA_CTRL_GPIO_PORT, CAMERA_PWON_PIN);
    gpio_bit_reset(CAMERA_CTRL_GPIO_PORT, CAMERA_RES_PIN);
    delay_1ms(5U);
    gpio_bit_set(CAMERA_CTRL_GPIO_PORT, CAMERA_RES_PIN);
    delay_1ms(20U);

    i2c_deinit(CAMERA_SCCB);
    i2c_timing_config(CAMERA_SCCB, 0U, 6U, 0U);
    i2c_master_clock_config(CAMERA_SCCB, 0x26U, 0x73U);
    i2c_address_config(CAMERA_SCCB, 0x00U, I2C_ADDFORMAT_7BITS);
    i2c_enable(CAMERA_SCCB);
}

static uint8_t camera_sccb_read_reg8(uint8_t reg, uint8_t *data)
{
    if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_I2CBSY)) {
        return 0U;
    }

