prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x1U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    i2c_start_on_bus(CAMERA_SCCB);

    i2c_data_transmit(CAMERA_SCCB, reg);
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }
    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_RECEIVE);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x1U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    delay_1ms(1U);
    i2c_start_on_bus(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_RBNE)) {
        return 0U;
    }

    *data = (uint8_t)i2c_data_receive(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    return 1U;
}

static uint8_t camera_sccb_read_reg16(uint16_t reg, uint8_t *data)
{
    if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_I2CBSY)) {
        return 0U;
    }

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x2U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    i2c_start_on_bus(CAMERA_SCCB);

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg >> 8U));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg & 0xFFU));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_RECEIVE);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x1U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    delay_1ms(1U);
    i2c_start_on_bus(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_RBNE)) {
        return 0U;
    }

    *data = (uint8_t)i2c_data_receive(CAMERA_SCCB);

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    return 1U;
}

static uint8_t camera_sccb_write_reg16(uint16_t reg, uint8_t data)
{
    if(SET == i2c_flag_get(CAMERA_SCCB, I2C_FLAG_I2CBSY)) {
        return 0U;
    }

    i2c_master_addressing(CAMERA_SCCB, CAMERA_SCCB_ADDR, I2C_MASTER_TRANSMIT);
    i2c_transfer_byte_number_config(CAMERA_SCCB, 0x3U);
    i2c_automatic_end_enable(CAMERA_SCCB);
    i2c_start_on_bus(CAMERA_SCCB);

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg >> 8U));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    i2c_data_transmit(CAMERA_SCCB, (uint8_t)(reg & 0xFFU));
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    i2c_data_transmit(CAMERA_SCCB, data);
    if(!camera_wait_flag(I2C_FLAG_TI)) {
        return 0U;
    }

    if(!camera_wait_flag(I2C_FLAG_STPDET)) {
        return 0U;
    }
    i2c_flag_clear(CAMERA_SCCB, I2C_FLAG_STPDET);

    return 1U;
}

static uint8_t edgecare_camera_id_probe(void)
{
    uint8_t ov5640_id_h = 0U;
    uint8_t ov5640_id_l = 0U;
    uint8_t ov2640_id_h = 0U;
    uint8_t ov2640_id_l = 0U;
    uint8_t ov5640_detected = 0U;

    camera_sccb_init();

    if(camera_sccb_read_reg16(0x300AU, &ov5640_id_h) &&
       camera_sccb_read_reg16(0x300BU, &ov5640_id_l)) {
        printf("camera_id: ov5640_regs[0x300A,0x300B]=0x%02X 0x%02X\r\n",
               ov5640_id_h, ov5640_id_l);
        ov5640_detected = ((0x56U == ov5640_id_h) && (0x40U == ov5640_id_l)) ? 1U : 0U;
    } else {
        printf("camera_id: OV5640 ID read timeout/no ack on PB10/PB11\r\n");
    }

    if((0U == ov5640_detected) &&
       camera_sccb_read_reg8(0x0AU, &ov2640_id_h) &&
       camera_sccb_read_reg8(0x0BU, &ov2640_id_l)) {
        printf("camera_id: ov2640_regs[0x0A,0x0B]=0x%02X 0x%02X\r\n",
               ov2640_id_h, ov2640_id_l);
    }

    while(RESET == usart_flag_get(EVAL_COM, USART_FLAG_TC)) {
    }

    return ov5640_detected;
}

static uint8_t edgecare_ov5640_qvga_stream_init(void)
{
    uint32_t i;
    uint8_t stream_ctl = 0U;
    uint8_t width_h = 0U;
    uint8_t width_l = 0U;
    uint8_t height_h = 0U;
    uint8_t height_l = 0U;

    printf("camera_init: ov5640 qvga yuv probe regs=%lu source=OV5640 app note 13.1.1/13.1.2\r\n",
           (unsigned long)(sizeof(g_ov5640_qvga_yuv_probe_regs) / sizeof(g_ov5640_qvga_yuv_probe_regs[0])));

    if(!camera_sccb_write_reg16(0x3008U, 0x82U)) {
        printf("camera_init: soft_reset write failed\r\n");
        return 0U;
    }
    delay_1ms(10U);

    for(i = 0U; i < (sizeof(g_ov5640_qvga_yuv_probe_regs) / sizeof(g_ov5640_qvga_yuv_probe_regs[0])); i++) {
        if(!camera_sccb_write_reg16(g_ov5640_qvga_yuv_probe_regs[i].reg,
                                    g_ov5640_qvga_yuv_probe_regs[i].value)) {
            printf("camera_init: write_failed reg=0x%04lX value=0x%02X index=%lu\r\n",
                   (unsigned long)g_ov5640_qvga_yuv_probe_regs[i].reg,
                   g_ov5640_qvga_yuv_probe_regs[i].value,
                   (unsigned long)i);
            return 0U;
        }
        if(0x3008U == g_ov5640_qvga_yuv_probe_regs[i].reg) {
            delay_1ms(5U);
        }
    }

    delay_1ms(100U);

    (void)camera_sccb_read_reg16(0x3008U, &stream_ctl);
    (void)camera_sccb_read_reg16(0x3808U, &width_h);
    (void)camera_sccb_read_reg16(0x3809U, &width_l);
    (void)camera_sccb_read_reg16(0x380AU, &height_h);
    (void)camera_sccb_read_reg16(0x380BU, &height_l);
    printf("camera_init: readback 3008=0x%02X size=%ux%u\r\n",
           stream_ctl,
           (uint16_t)(((uint16_t)width_h << 8U) | width_l),
           (uint16_t)(((uint16_t)height_h << 8U) | height_l));

    return 1U;
}

static void camera_dvp_gpio_activity_probe(void)
{
    uint32_t burst;
    uint32_t i;
    uint32_t pclk_edges = 0U;
    uint32_t href_edges = 0U;
    uint32_t sync_edges = 0U;
    uint32_t href_high_samples = 0U;
    uint32_t sync_high_samples = 0U;
    FlagStatus pclk_prev;
    FlagStatus href_prev;
    FlagStatus sync_prev;
    FlagStatus pclk_now;
    FlagStatus href_now;
    FlagStatus sync_now;

    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);

    gpio_mode_set(GPIOA, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_INPUT, GPIO_PUPD_NONE, GPIO_PIN_7);

    pclk_prev = gpio_input_bit_get(GPIOA, GPIO_PIN_6);
    href_prev = gpio_input_bit_get(GPIOA, GPIO_PIN_4);
    sync_prev = gpio_input_bit_get(GPIOB, GPIO_PIN_7);

    for(burst = 0U; burst < 80U; burst++) {
        for(i = 0U; i < 50000U; i++) {
            pclk_now = gpio_input_bit_get(GPIOA, GPIO_PIN_6);
            href_now = gpio_input_bit_get(GPIOA, GPIO_PIN_4);
            sync_now = gpio_input_bit_get(GPIOB, GPIO_PIN_7);

            if(SET == href_now) {
                href_high_samples++;
            }
            if(SET == sync_now) {
                sync_high_samples++;
            }

