prophetricker/EdgeCare-GD32-Industrial-Violation-Detection-Terminal/EdgeCare_GD32_Industrial_Violation_Terminal/GD32H759I_START_Demo_Suites/Projects/01_EdgeCare_Industrial_Violation_Terminal/main.c
            if(pclk_now != pclk_prev) {
                pclk_edges++;
                pclk_prev = pclk_now;
            }
            if(href_now != href_prev) {
                href_edges++;
                href_prev = href_now;
            }
            if(sync_now != sync_prev) {
                sync_edges++;
                sync_prev = sync_now;
            }
        }
    }

    printf("camera_dvp_gpio: bursts=80 samples_per_burst=50000 pclk_edges=%lu href_edges=%lu sync_edges=%lu href_high=%lu sync_high=%lu pclk=%u href=%u sync=%u\r\n",
           (unsigned long)pclk_edges,
           (unsigned long)href_edges,
           (unsigned long)sync_edges,
           (unsigned long)href_high_samples,
           (unsigned long)sync_high_samples,
           (SET == pclk_prev) ? 1U : 0U,
           (SET == href_prev) ? 1U : 0U,
           (SET == sync_prev) ? 1U : 0U);
}

static void camera_dci_gpio_init(void)
{
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_GPIOB);
    rcu_periph_clock_enable(RCU_GPIOC);
    rcu_periph_clock_enable(RCU_GPIOE);
    rcu_periph_clock_enable(RCU_GPIOG);
    rcu_periph_clock_enable(RCU_DCI);

    /* DCI_PIXCLK(PA6), DCI_HSYNC(PA4), DCI_VSYNC(PB7). */
    gpio_af_set(GPIOA, GPIO_AF_13, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_af_set(GPIOB, GPIO_AF_13, GPIO_PIN_7);

    gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_4 | GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_7);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_7);

    /* D0(PC6), D1(PC7), D2(PC8), D3(PG11), D4(PE4), D5(PB6), D6(PE5), D7(PE6). */
    gpio_af_set(GPIOC, GPIO_AF_13, GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8);
    gpio_af_set(GPIOG, GPIO_AF_13, GPIO_PIN_11);
    gpio_af_set(GPIOE, GPIO_AF_13, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6);
    gpio_af_set(GPIOB, GPIO_AF_13, GPIO_PIN_6);

    gpio_mode_set(GPIOC, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8);
    gpio_output_options_set(GPIOC, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ,
                            GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8);
    gpio_mode_set(GPIOG, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_11);
    gpio_output_options_set(GPIOG, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_11);
    gpio_mode_set(GPIOE, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6);
    gpio_output_options_set(GPIOE, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ,
                            GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6);
    gpio_mode_set(GPIOB, GPIO_MODE_AF, GPIO_PUPD_NONE, GPIO_PIN_6);
    gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, GPIO_PIN_6);
}

static void camera_dci_dma_init(uint32_t hsync_polarity, uint32_t vsync_polarity)
{
    dci_parameter_struct dci_struct;
    dma_single_data_parameter_struct dma_struct;

    camera_dci_gpio_init();

    dci_deinit();
    dci_struct.capture_mode = DCI_CAPTURE_MODE_CONTINUOUS;
    dci_struct.clock_polarity = DCI_CK_POLARITY_RISING;
    dci_struct.hsync_polarity = hsync_polarity;
    dci_struct.vsync_polarity = vsync_polarity;
    dci_struct.frame_rate = DCI_FRAME_RATE_ALL;
    dci_struct.interface_format = DCI_INTERFACE_FORMAT_8BITS;
    dci_init(&dci_struct);

    rcu_periph_clock_enable(RCU_DMA1);
    rcu_periph_clock_enable(RCU_DMAMUX);

    dma_channel_disable(DMA1, DMA_CH7);
    dma_deinit(DMA1, DMA_CH7);
    dma_single_data_para_struct_init(&dma_struct);
    dma_struct.request = DMA_REQUEST_DCI;
    dma_struct.periph_addr = DCI_DATA_ADDRESS;
    dma_struct.memory0_addr = (uint32_t)g_camera_capture_buffer;
    dma_struct.direction = DMA_PERIPH_TO_MEMORY;
    dma_struct.number = CAMERA_CAPTURE_WORDS;
    dma_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_struct.periph_memory_width = DMA_PERIPH_WIDTH_32BIT;
    dma_struct.circular_mode = DMA_CIRCULAR_MODE_DISABLE;
    dma_struct.priority = DMA_PRIORITY_HIGH;
    dma_single_data_mode_init(DMA1, DMA_CH7, &dma_struct);
}

static uint8_t camera_frame_y_at(uint32_t pixel_index)
{
    uint8_t *frame = (uint8_t *)g_camera_capture_buffer;
    uint32_t pair_offset = (pixel_index / 2U) * 4U;

    /* OV5640 0x4300 low bits select YUYV. In memory: even pixel Y at byte 0, odd pixel Y at byte 2. */
    if(0U == (pixel_index & 1U)) {
        return frame[pair_offset];
    }

    return frame[pair_offset + 2U];
}

static uint8_t edgecare_infer(const uint8_t *input, edgecare_infer_result_t *result)
{
    uint32_t i;
    uint32_t sum = 0U;
    uint8_t min_value = 0xFFU;
    uint8_t max_value = 0U;
    uint8_t value;

    for(i = 0U; i < MODEL_INPUT_BYTES; i++) {
        value = input[i];
        sum += value;
        if(value < min_value) {
            min_value = value;
        }
        if(value > max_value) {
            max_value = value;
        }
    }

    result->mean = (uint8_t)(sum / MODEL_INPUT_BYTES);
    result->contrast = (uint8_t)(max_value - min_value);

    /*
       Placeholder until the PC-trained model is ready. It proves the model interface
       and gives a scene-sensitive number, but it is not a real intrusion classifier.
    */
    result->confidence_percent = (result->contrast > 120U) ? 90U : (uint8_t)((result->contrast * 3U) / 4U);
    result->intrusion = (result->confidence_percent >= 75U) ? 1U : 0U;

    return 1U;
}

static void edgecare_preprocess_gray96_probe(void)
{
    uint32_t x;
    uint32_t y;
    uint32_t checksum = 0U;
    uint32_t sum = 0U;
    uint8_t min_value = 0xFFU;
    uint8_t max_value = 0U;
    uint8_t value;
    edgecare_infer_result_t infer_result;

    for(y = 0U; y < MODEL_INPUT_HEIGHT; y++) {
        uint32_t src_y = (y * CAMERA_FRAME_HEIGHT) / MODEL_INPUT_HEIGHT;
        for(x = 0U; x < MODEL_INPUT_WIDTH; x++) {
            uint32_t src_x = (x * CAMERA_FRAME_WIDTH) / MODEL_INPUT_WIDTH;
            uint32_t src_pixel = (src_y * CAMERA_FRAME_WIDTH) + src_x;
            uint32_t dst_index = (y * MODEL_INPUT_WIDTH) + x;

            value = camera_frame_y_at(src_pixel);
            g_model_input_gray[dst_index] = value;
            sum += value;
            checksum ^= ((uint32_t)value << ((dst_index & 3U) * 8U));
            checksum = (checksum << 3U) | (checksum >> 29U);

